<?xml version="1.0"?>
<net name="Model3" version="11">
	<layers>
		<layer id="2" name="decoder_input_ids" type="Parameter" version="opset1">
			<data shape="?,?" element_type="i64" />
			<output>
				<port id="0" precision="I64" names="input_ids">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Parameter_25873" type="Parameter" version="opset1">
			<data shape="?,?,1280" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="encoder_hidden_states">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="0" name="beam_idx" type="Parameter" version="opset1">
			<data shape="?" element_type="i32" />
			<output>
				<port id="0" precision="I32" names="beam_idx">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="self.model.decoder.layers.2.encoder_attn.k_proj.weight" type="Const" version="opset1">
			<data element_type="u8" shape="1280, 1280" offset="0" size="1638400" />
			<output>
				<port id="0" precision="U8">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Convert_1025487" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="self.model.decoder.layers.2.encoder_attn.k_proj.weight/zero_point" type="Const" version="opset1">
			<data element_type="u8" shape="1280, 1" offset="1638400" size="1280" />
			<output>
				<port id="0" precision="U8">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Convert_1025490" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="self.model.decoder.layers.2.encoder_attn.k_proj.weight/zero_point/subtract" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="self.model.decoder.layers.2.encoder_attn.k_proj.weight/scale" type="Const" version="opset1">
			<data element_type="f16" shape="1280, 1" offset="1639680" size="2560" />
			<output>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="self.model.decoder.layers.2.encoder_attn.k_proj.weight/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="self.model.decoder.layers.2.encoder_attn.k_proj.weight/fq_weights_1/convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="__module.model.decoder.layers.2.encoder_attn.k_proj/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="473">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Constant_35971" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="1642240" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="__module.model.decoder.layers.2.encoder_attn/aten::view/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="475,key_states.17">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>20</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="__module.model.decoder.layers.2.encoder_attn/aten::transpose/Constant_1" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="1642272" size="16" />
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="__module.model.decoder.layers.2.encoder_attn/aten::transpose/Transpose_1" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>20</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="481">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="ReadValue_37988" type="ReadValue" version="opset6">
			<data variable_id="481" variable_type="dynamic" variable_shape="..." />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="self.model.decoder.layers.0.encoder_attn.k_proj.weight" type="Const" version="opset1">
			<data element_type="u8" shape="1280, 1280" offset="1642288" size="1638400" />
			<output>
				<port id="0" precision="U8">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Convert_1030265" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="self.model.decoder.layers.0.encoder_attn.k_proj.weight/zero_point" type="Const" version="opset1">
			<data element_type="u8" shape="1280, 1" offset="3280688" size="1280" />
			<output>
				<port id="0" precision="U8">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Convert_1030268" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="self.model.decoder.layers.0.encoder_attn.k_proj.weight/zero_point/subtract" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="self.model.decoder.layers.0.encoder_attn.k_proj.weight/scale" type="Const" version="opset1">
			<data element_type="f16" shape="1280, 1" offset="3281968" size="2560" />
			<output>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="self.model.decoder.layers.0.encoder_attn.k_proj.weight/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="self.model.decoder.layers.0.encoder_attn.k_proj.weight/fq_weights_1/convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="__module.model.decoder.layers.0.encoder_attn.k_proj/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="217">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Constant_35955" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="1642240" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="__module.model.decoder.layers.0.encoder_attn/aten::view/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="219,key_states.5">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>20</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="__module.model.decoder.layers.0.encoder_attn/aten::transpose/Constant_1" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="1642272" size="16" />
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="__module.model.decoder.layers.0.encoder_attn/aten::transpose/Transpose_1" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>20</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="225">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="ReadValue_37986" type="ReadValue" version="opset6">
			<data variable_id="225" variable_type="dynamic" variable_shape="..." />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="self.model.decoder.layers.1.encoder_attn.v_proj.weight" type="Const" version="opset1">
			<data element_type="u8" shape="1280, 1280" offset="3284528" size="1638400" />
			<output>
				<port id="0" precision="U8">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Convert_1035043" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="self.model.decoder.layers.1.encoder_attn.v_proj.weight/zero_point" type="Const" version="opset1">
			<data element_type="u8" shape="1280, 1" offset="4922928" size="1280" />
			<output>
				<port id="0" precision="U8">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Convert_1035046" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="self.model.decoder.layers.1.encoder_attn.v_proj.weight/zero_point/subtract" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="self.model.decoder.layers.1.encoder_attn.v_proj.weight/scale" type="Const" version="opset1">
			<data element_type="f16" shape="1280, 1" offset="4924208" size="2560" />
			<output>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="self.model.decoder.layers.1.encoder_attn.v_proj.weight/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="self.model.decoder.layers.1.encoder_attn.v_proj.weight/fq_weights_1/convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="__module.model.decoder.layers.1.encoder_attn.v_proj/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Constant_35186" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1280" offset="4926768" size="5120" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="__module.model.decoder.layers.1.encoder_attn.v_proj/aten::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="350">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Constant_35964" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="1642240" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="__module.model.decoder.layers.1.encoder_attn/aten::view/Reshape_2" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="352,value_states.11">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>20</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="__module.model.decoder.layers.1.encoder_attn/aten::transpose/Constant_2" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="1642272" size="16" />
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="__module.model.decoder.layers.1.encoder_attn/aten::transpose/Transpose_2" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>20</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="355">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="ReadValue_37984" type="ReadValue" version="opset6">
			<data variable_id="355" variable_type="dynamic" variable_shape="..." />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="self.model.decoder.layers.3.encoder_attn.v_proj.weight" type="Const" version="opset1">
			<data element_type="u8" shape="1280, 1280" offset="4931888" size="1638400" />
			<output>
				<port id="0" precision="U8">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Convert_1039821" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="self.model.decoder.layers.3.encoder_attn.v_proj.weight/zero_point" type="Const" version="opset1">
			<data element_type="u8" shape="1280, 1" offset="6570288" size="1280" />
			<output>
				<port id="0" precision="U8">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Convert_1039824" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="self.model.decoder.layers.3.encoder_attn.v_proj.weight/zero_point/subtract" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="self.model.decoder.layers.3.encoder_attn.v_proj.weight/scale" type="Const" version="opset1">
			<data element_type="f16" shape="1280, 1" offset="6571568" size="2560" />
			<output>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="self.model.decoder.layers.3.encoder_attn.v_proj.weight/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="self.model.decoder.layers.3.encoder_attn.v_proj.weight/fq_weights_1/convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="__module.model.decoder.layers.3.encoder_attn.v_proj/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Constant_35218" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1280" offset="6574128" size="5120" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="__module.model.decoder.layers.3.encoder_attn.v_proj/aten::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="606">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Constant_35980" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="1642240" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="__module.model.decoder.layers.3.encoder_attn/aten::view/Reshape_2" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="608,value_states">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>20</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="__module.model.decoder.layers.3.encoder_attn/aten::transpose/Constant_2" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="1642272" size="16" />
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="__module.model.decoder.layers.3.encoder_attn/aten::transpose/Transpose_2" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>20</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="611">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="ReadValue_37982" type="ReadValue" version="opset6">
			<data variable_id="611" variable_type="dynamic" variable_shape="..." />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="self.model.decoder.layers.2.encoder_attn.v_proj.weight" type="Const" version="opset1">
			<data element_type="u8" shape="1280, 1280" offset="6579248" size="1638400" />
			<output>
				<port id="0" precision="U8">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Convert_1044599" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="self.model.decoder.layers.2.encoder_attn.v_proj.weight/zero_point" type="Const" version="opset1">
			<data element_type="u8" shape="1280, 1" offset="8217648" size="1280" />
			<output>
				<port id="0" precision="U8">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Convert_1044602" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="self.model.decoder.layers.2.encoder_attn.v_proj.weight/zero_point/subtract" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="self.model.decoder.layers.2.encoder_attn.v_proj.weight/scale" type="Const" version="opset1">
			<data element_type="f16" shape="1280, 1" offset="8218928" size="2560" />
			<output>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="self.model.decoder.layers.2.encoder_attn.v_proj.weight/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="self.model.decoder.layers.2.encoder_attn.v_proj.weight/fq_weights_1/convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="__module.model.decoder.layers.2.encoder_attn.v_proj/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Constant_35202" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1280" offset="8221488" size="5120" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="__module.model.decoder.layers.2.encoder_attn.v_proj/aten::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="478">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Constant_35972" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="1642240" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="__module.model.decoder.layers.2.encoder_attn/aten::view/Reshape_2" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="480,value_states.17">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>20</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="__module.model.decoder.layers.2.encoder_attn/aten::transpose/Constant_2" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="1642272" size="16" />
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="__module.model.decoder.layers.2.encoder_attn/aten::transpose/Transpose_2" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>20</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="483">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="ReadValue_37980" type="ReadValue" version="opset6">
			<data variable_id="483" variable_type="dynamic" variable_shape="..." />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="self.model.decoder.layers.1.encoder_attn.k_proj.weight" type="Const" version="opset1">
			<data element_type="u8" shape="1280, 1280" offset="8226608" size="1638400" />
			<output>
				<port id="0" precision="U8">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Convert_1049377" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="self.model.decoder.layers.1.encoder_attn.k_proj.weight/zero_point" type="Const" version="opset1">
			<data element_type="u8" shape="1280, 1" offset="9865008" size="1280" />
			<output>
				<port id="0" precision="U8">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Convert_1049380" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="self.model.decoder.layers.1.encoder_attn.k_proj.weight/zero_point/subtract" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="self.model.decoder.layers.1.encoder_attn.k_proj.weight/scale" type="Const" version="opset1">
			<data element_type="f16" shape="1280, 1" offset="9866288" size="2560" />
			<output>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="self.model.decoder.layers.1.encoder_attn.k_proj.weight/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="self.model.decoder.layers.1.encoder_attn.k_proj.weight/fq_weights_1/convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="__module.model.decoder.layers.1.encoder_attn.k_proj/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="345">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Constant_35963" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="1642240" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="__module.model.decoder.layers.1.encoder_attn/aten::view/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="347,key_states.11">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>20</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="__module.model.decoder.layers.1.encoder_attn/aten::transpose/Constant_1" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="1642272" size="16" />
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="__module.model.decoder.layers.1.encoder_attn/aten::transpose/Transpose_1" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>20</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="353">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="ReadValue_37978" type="ReadValue" version="opset6">
			<data variable_id="353" variable_type="dynamic" variable_shape="..." />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="self.model.decoder.layers.3.encoder_attn.k_proj.weight" type="Const" version="opset1">
			<data element_type="u8" shape="1280, 1280" offset="9868848" size="1638400" />
			<output>
				<port id="0" precision="U8">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Convert_1054155" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="self.model.decoder.layers.3.encoder_attn.k_proj.weight/zero_point" type="Const" version="opset1">
			<data element_type="u8" shape="1280, 1" offset="11507248" size="1280" />
			<output>
				<port id="0" precision="U8">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Convert_1054158" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="self.model.decoder.layers.3.encoder_attn.k_proj.weight/zero_point/subtract" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="self.model.decoder.layers.3.encoder_attn.k_proj.weight/scale" type="Const" version="opset1">
			<data element_type="f16" shape="1280, 1" offset="11508528" size="2560" />
			<output>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="self.model.decoder.layers.3.encoder_attn.k_proj.weight/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="self.model.decoder.layers.3.encoder_attn.k_proj.weight/fq_weights_1/convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="__module.model.decoder.layers.3.encoder_attn.k_proj/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="601">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="Constant_35979" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="1642240" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="__module.model.decoder.layers.3.encoder_attn/aten::view/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="603,key_states">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>20</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="__module.model.decoder.layers.3.encoder_attn/aten::transpose/Constant_1" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="1642272" size="16" />
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="__module.model.decoder.layers.3.encoder_attn/aten::transpose/Transpose_1" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>20</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="609">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="ReadValue_37976" type="ReadValue" version="opset6">
			<data variable_id="609" variable_type="dynamic" variable_shape="..." />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="self.model.decoder.layers.0.encoder_attn.v_proj.weight" type="Const" version="opset1">
			<data element_type="u8" shape="1280, 1280" offset="11511088" size="1638400" />
			<output>
				<port id="0" precision="U8">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="Convert_1058933" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="self.model.decoder.layers.0.encoder_attn.v_proj.weight/zero_point" type="Const" version="opset1">
			<data element_type="u8" shape="1280, 1" offset="13149488" size="1280" />
			<output>
				<port id="0" precision="U8">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="Convert_1058936" type="Convert" version="opset1">
			<data destination_type="f16" />
			<input>
				<port id="0" precision="U8">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP16">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="self.model.decoder.layers.0.encoder_attn.v_proj.weight/zero_point/subtract" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="self.model.decoder.layers.0.encoder_attn.v_proj.weight/scale" type="Const" version="opset1">
			<data element_type="f16" shape="1280, 1" offset="13150768" size="2560" />
			<output>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="self.model.decoder.layers.0.encoder_attn.v_proj.weight/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1280</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="self.model.decoder.layers.0.encoder_attn.v_proj.weight/fq_weights_1/convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="FP16">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="__module.model.decoder.layers.0.encoder_attn.v_proj/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1280</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="Constant_35170" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1280" offset="13153328" size="5120" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="__module.model.decoder.layers.0.encoder_attn.v_proj/aten::linear/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1280</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="222">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="Constant_35956" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="1642240" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="__module.model.decoder.layers.0.encoder_attn/aten::view/Reshape_2" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1280</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="224,value_states.5">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>20</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="__module.model.decoder.layers.0.encoder_attn/aten::transpose/Constant_2" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="1642272" size="16" />
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="__module.model.decoder.layers.0.encoder_attn/aten::transpose/Transpose_2" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>20</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="227">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="129" name="ReadValue_37974" type="ReadValue" version="opset6">
			<data variable_id="227" variable_type="dynamic" variable_shape="..." />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>20</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="131" name="Constant_37602" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="13158448" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="132" name="ShapeOf_37588" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="133" name="Constant_37590" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="13158452" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="134" name="Constant_37592" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="13158452" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="135" name="Gather_37593" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
